; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v11 ?v4)
             (pred_8 ?v5 ?v9)
             (pred_1 ?v11 ?v9)
             (pred_9 ?v6 ?v11 )
	     (pred_11 ?v11)
             (pred_5 ?v3)
             (pred_10 ?v5)
             (pred_4 ?v9)
             (pred_2 ?v11)
             (pred_6 ?v5)
             (pred_3 ?v11)
             (pred_7 ))



(:action op_2
:parameters (?v13 ?v12 ?v8 ?v7)
:precondition (and (pred_5 ?v13) (pred_5 ?v12) (pred_10 ?v8) (pred_4 ?v7)
          (pred_12 ?v13 ?v12) (pred_8 ?v8 ?v7)
                   (pred_1 ?v12 ?v7) (pred_11 ?v13) 
                   (pred_2 ?v12) (pred_6 ?v8))
:effect (and  (pred_3 ?v12) (not (pred_2 ?v12))))


(:action op_1
:parameters (?v13 ?v2)
:precondition (and (pred_5 ?v13) (pred_5 ?v2)
               (pred_11 ?v13) (pred_12 ?v13 ?v2) (pred_3 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v13))))

(:action op_5
:parameters (?v13 ?v8)
:precondition (and (pred_5 ?v13) (pred_10 ?v8) 
                  (pred_11 ?v13) (pred_9 ?v8 ?v13) (pred_7 ))
:effect (and (pred_6 ?v8)
   (not (pred_9 ?v8 ?v13)) (not (pred_7 ))))


(:action op_3
:parameters (?v13 ?v10 ?v1)
:precondition (and (pred_5 ?v13) (pred_10 ?v10) (pred_10 ?v1)
                  (pred_11 ?v13) (pred_6 ?v1) (pred_9 ?v10 ?v13))
:effect (and (pred_6 ?v10) (pred_9 ?v1 ?v13)
        (not (pred_6 ?v1)) (not (pred_9 ?v10 ?v13))))

(:action op_4
:parameters (?v13 ?v8)
:precondition (and (pred_5 ?v13) (pred_10 ?v8) 
                  (pred_11 ?v13) (pred_6 ?v8))
:effect (and (pred_7 ) (pred_9 ?v8 ?v13) (not (pred_6 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_14 obj_08 obj_09 obj_16 obj_02 obj_06 obj_12 obj_05 obj_25 obj_24 obj_23 obj_22 obj_18 obj_10 obj_01 obj_29 obj_20 obj_21 obj_15 obj_28 obj_32 obj_07 obj_13 obj_30
    obj_03 obj_04 obj_19
    obj_11 obj_31 obj_17 obj_26
    )

    (:init
       (pred_7)

       (pred_5 obj_27)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_02)
       (pred_5 obj_06)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_25)
       (pred_5 obj_24)
       (pred_5 obj_23)
       (pred_5 obj_22)
       (pred_5 obj_18)
       (pred_5 obj_10)
       (pred_5 obj_01)
       (pred_5 obj_29)
       (pred_5 obj_20)
       (pred_5 obj_21)
       (pred_5 obj_15)
       (pred_5 obj_28)
       (pred_5 obj_32)
       (pred_5 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_30)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_19)
       (pred_10 obj_11)
       (pred_10 obj_31)
       (pred_10 obj_17)
       (pred_10 obj_26)

       (pred_12 obj_27 obj_02)
       (pred_12 obj_27 obj_14)
       (pred_12 obj_14 obj_06)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_27)
       (pred_12 obj_08 obj_12)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_09 obj_05)
       (pred_12 obj_09 obj_16)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_16 obj_25)
       (pred_12 obj_16 obj_09)
       (pred_12 obj_02 obj_24)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_27)
       (pred_12 obj_06 obj_23)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_06 obj_14)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_12 obj_22)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_12 obj_08)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_05 obj_25)
       (pred_12 obj_05 obj_09)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_25 obj_10)
       (pred_12 obj_25 obj_16)
       (pred_12 obj_25 obj_05)
       (pred_12 obj_24 obj_01)
       (pred_12 obj_24 obj_23)
       (pred_12 obj_24 obj_02)
       (pred_12 obj_23 obj_29)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_06)
       (pred_12 obj_23 obj_24)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_22 obj_18)
       (pred_12 obj_22 obj_12)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_18 obj_21)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_22)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_25)
       (pred_12 obj_10 obj_18)
       (pred_12 obj_01 obj_28)
       (pred_12 obj_01 obj_29)
       (pred_12 obj_01 obj_24)
       (pred_12 obj_29 obj_32)
       (pred_12 obj_29 obj_20)
       (pred_12 obj_29 obj_23)
       (pred_12 obj_29 obj_01)
       (pred_12 obj_20 obj_07)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_29)
       (pred_12 obj_21 obj_13)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_18)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_15 obj_30)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_28 obj_32)
       (pred_12 obj_28 obj_01)
       (pred_12 obj_32 obj_07)
       (pred_12 obj_32 obj_29)
       (pred_12 obj_32 obj_28)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_07 obj_20)
       (pred_12 obj_07 obj_32)
       (pred_12 obj_13 obj_30)
       (pred_12 obj_13 obj_21)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_30 obj_15)
       (pred_12 obj_30 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_16)
       (pred_2 obj_15)
       (pred_1  obj_18 obj_03)
       (pred_1  obj_08 obj_04)
       (pred_1  obj_16 obj_19)
       (pred_1  obj_15 obj_19)
       (pred_3 obj_27)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_25)
       (pred_3 obj_24)
       (pred_3 obj_23)
       (pred_3 obj_22)
       (pred_3 obj_10)
       (pred_3 obj_01)
       (pred_3 obj_29)
       (pred_3 obj_20)
       (pred_3 obj_21)
       (pred_3 obj_28)
       (pred_3 obj_32)
       (pred_3 obj_07)
       (pred_3 obj_13)
       (pred_3 obj_30)

       (pred_8  obj_11 obj_03)
       (pred_8  obj_31 obj_04)
       (pred_8  obj_17 obj_19)
       (pred_8  obj_26 obj_04)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_31 obj_21)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_26 obj_05)
       (pred_11 obj_23)
    )

    (:goal (and
       (pred_9 obj_11 obj_09)
       (pred_9 obj_31 obj_24)
       (pred_9 obj_17 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_22)))
)
)

; plan
1. (op_1 obj_23 obj_29)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_29)
   goals met: 0 of 3
2. (op_1 obj_29 obj_20)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_20)
   goals met: 0 of 3
3. (op_1 obj_20 obj_21)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_21)
   goals met: 0 of 3
4. (op_5 obj_21 obj_31)
   deleted: (pred_9 obj_31 obj_21) (pred_7)
   added: (pred_6 obj_31)
   goals met: 0 of 3
5. (op_1 obj_21 obj_20)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_20)
   goals met: 0 of 3
6. (op_3 obj_20 obj_17 obj_31)
   deleted: (pred_6 obj_31) (pred_9 obj_17 obj_20)
   added: (pred_6 obj_17) (pred_9 obj_31 obj_20)
   goals met: 0 of 3
7. (op_1 obj_20 obj_29)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_29)
   goals met: 0 of 3
8. (op_1 obj_29 obj_23)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_23)
   goals met: 0 of 3
9. (op_1 obj_23 obj_06)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_06)
   goals met: 0 of 3
10. (op_4 obj_06 obj_17)
   deleted: (pred_6 obj_17)
   added: (pred_7) (pred_9 obj_17 obj_06)
   goals met: 1 of 3
11. (op_1 obj_06 obj_23)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_23)
   goals met: 1 of 3
12. (op_1 obj_23 obj_29)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_29)
   goals met: 1 of 3
13. (op_1 obj_29 obj_20)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_20)
   goals met: 1 of 3
14. (op_5 obj_20 obj_31)
   deleted: (pred_9 obj_31 obj_20) (pred_7)
   added: (pred_6 obj_31)
   goals met: 1 of 3
15. (op_1 obj_20 obj_29)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_29)
   goals met: 1 of 3
16. (op_1 obj_29 obj_23)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_23)
   goals met: 1 of 3
17. (op_1 obj_23 obj_06)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_06)
   goals met: 1 of 3
18. (op_1 obj_06 obj_14)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_14)
   goals met: 1 of 3
19. (op_2 obj_14 obj_08 obj_31 obj_04)
   deleted: (pred_2 obj_08)
   added: (pred_3 obj_08)
   goals met: 1 of 3
20. (op_3 obj_14 obj_11 obj_31)
   deleted: (pred_6 obj_31) (pred_9 obj_11 obj_14)
   added: (pred_6 obj_11) (pred_9 obj_31 obj_14)
   goals met: 1 of 3
21. (op_1 obj_14 obj_08)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_08)
   goals met: 1 of 3
22. (op_1 obj_08 obj_09)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_09)
   goals met: 1 of 3
23. (op_4 obj_09 obj_11)
   deleted: (pred_6 obj_11)
   added: (pred_7) (pred_9 obj_11 obj_09)
   goals met: 2 of 3
24. (op_1 obj_09 obj_08)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_08)
   goals met: 2 of 3
25. (op_1 obj_08 obj_14)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_14)
   goals met: 2 of 3
26. (op_5 obj_14 obj_31)
   deleted: (pred_9 obj_31 obj_14) (pred_7)
   added: (pred_6 obj_31)
   goals met: 2 of 3
27. (op_1 obj_14 obj_27)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_27)
   goals met: 2 of 3
28. (op_1 obj_27 obj_02)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_02)
   goals met: 2 of 3
29. (op_1 obj_02 obj_24)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_24)
   goals met: 2 of 3
30. (op_4 obj_24 obj_31)
   deleted: (pred_6 obj_31)
   added: (pred_7) (pred_9 obj_31 obj_24)
   goals met: 3 of 3
